# Домашнє завдання: Модуль - 5, завдання - 1. Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)
'''
ОПИС:
    Функція, яка створює та використовує кеш для зберігання та повторного використання
    вже обчислених значень чисел Фібоначчі.
ВХІДНІ ПАРАМЕТРИ:
    n (int) - n-не число Фібоначчі.
ВИХІДНІ ДАНІ:
    результат (int) обчислення n-го члена ряду Фібоначчі.
ПРИКЛАД ВИКОРИСТАННЯ:
    fib = caching_fibonacci()
    print(fib(15)) # Виведе 610
    print(fib(10)) # Виведе 55
'''


def caching_fibonacci():
    # Ініціалізація кешу результатів обчислень (словник)
    cache = {}

    # Функція обчислення n-го числа Фібоначчі
    def fibonacci(n):
        if n <= 0:
            return 0
        elif n == 1:
            return 1

        # Якщо число вже знаходиться у кеші, функція повертає значення з кешу, зменшуючи кількість рекурсивних викликів
        if n in cache:
            return cache[n]

        # Загальна формула розрахунку n-ого члена ряду Фібоначчі. Рекурсивний метод
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]

    # Повернення функції для обчислення n-ого члена ряду Фібоначчі
    return fibonacci
